oskarvh/ComSciCalculator/firmware/renesas/ek-ra4m3/inc/hal_data.c
/* generated HAL source file - do not edit */
#include "hal_data.h"

gpt_instance_ctrl_t g_timer1_ctrl;
#if 0
const gpt_extended_pwm_cfg_t g_timer1_pwm_extend =
{
    .trough_ipl          = (BSP_IRQ_DISABLED),
#if defined(VECTOR_NUMBER_GPT1_COUNTER_UNDERFLOW)
    .trough_irq          = VECTOR_NUMBER_GPT1_COUNTER_UNDERFLOW,
#else
    .trough_irq          = FSP_INVALID_VECTOR,
#endif
    .poeg_link           = GPT_POEG_LINK_POEG0,
    .output_disable      = (gpt_output_disable_t) ( GPT_OUTPUT_DISABLE_NONE),
    .adc_trigger         = (gpt_adc_trigger_t) ( GPT_ADC_TRIGGER_NONE),
    .dead_time_count_up  = 0,
    .dead_time_count_down = 0,
    .adc_a_compare_match = 0,
    .adc_b_compare_match = 0,
    .interrupt_skip_source = GPT_INTERRUPT_SKIP_SOURCE_NONE,
    .interrupt_skip_count  = GPT_INTERRUPT_SKIP_COUNT_0,
    .interrupt_skip_adc    = GPT_INTERRUPT_SKIP_ADC_NONE,
    .gtioca_disable_setting = GPT_GTIOC_DISABLE_PROHIBITED,
    .gtiocb_disable_setting = GPT_GTIOC_DISABLE_PROHIBITED,
};
#endif
const gpt_extended_cfg_t g_timer1_extend = {
    .gtioca = {.output_enabled = false, .stop_level = GPT_PIN_LEVEL_LOW},
    .gtiocb = {.output_enabled = false, .stop_level = GPT_PIN_LEVEL_LOW},
    .start_source = (gpt_source_t)(GPT_SOURCE_NONE),
    .stop_source = (gpt_source_t)(GPT_SOURCE_NONE),
    .clear_source = (gpt_source_t)(GPT_SOURCE_NONE),
    .count_up_source = (gpt_source_t)(GPT_SOURCE_NONE),
    .count_down_source = (gpt_source_t)(GPT_SOURCE_NONE),
    .capture_a_source = (gpt_source_t)(GPT_SOURCE_NONE),
    .capture_b_source = (gpt_source_t)(GPT_SOURCE_NONE),
    .capture_a_ipl = (BSP_IRQ_DISABLED),
    .capture_b_ipl = (BSP_IRQ_DISABLED),
#if defined(VECTOR_NUMBER_GPT1_CAPTURE_COMPARE_A)
    .capture_a_irq = VECTOR_NUMBER_GPT1_CAPTURE_COMPARE_A,
#else
    .capture_a_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_GPT1_CAPTURE_COMPARE_B)
    .capture_b_irq = VECTOR_NUMBER_GPT1_CAPTURE_COMPARE_B,
#else
    .capture_b_irq = FSP_INVALID_VECTOR,
#endif
    .capture_filter_gtioca = GPT_CAPTURE_FILTER_NONE,
    .capture_filter_gtiocb = GPT_CAPTURE_FILTER_NONE,
#if 0
    .p_pwm_cfg                   = &g_timer1_pwm_extend,
#else
    .p_pwm_cfg = NULL,
#endif
#if 0
    .gtior_setting.gtior_b.gtioa  = (0U << 4U) | (0U << 2U) | (0U << 0U),
    .gtior_setting.gtior_b.oadflt = (uint32_t) GPT_PIN_LEVEL_LOW,
    .gtior_setting.gtior_b.oahld  = 0U,
    .gtior_setting.gtior_b.oae    = (uint32_t) false,
    .gtior_setting.gtior_b.oadf   = (uint32_t) GPT_GTIOC_DISABLE_PROHIBITED,
    .gtior_setting.gtior_b.nfaen  = ((uint32_t) GPT_CAPTURE_FILTER_NONE & 1U),
    .gtior_setting.gtior_b.nfcsa  = ((uint32_t) GPT_CAPTURE_FILTER_NONE >> 1U),
    .gtior_setting.gtior_b.gtiob  = (0U << 4U) | (0U << 2U) | (0U << 0U),
    .gtior_setting.gtior_b.obdflt = (uint32_t) GPT_PIN_LEVEL_LOW,
    .gtior_setting.gtior_b.obhld  = 0U,
    .gtior_setting.gtior_b.obe    = (uint32_t) false,
    .gtior_setting.gtior_b.obdf   = (uint32_t) GPT_GTIOC_DISABLE_PROHIBITED,
    .gtior_setting.gtior_b.nfben  = ((uint32_t) GPT_CAPTURE_FILTER_NONE & 1U),
    .gtior_setting.gtior_b.nfcsb  = ((uint32_t) GPT_CAPTURE_FILTER_NONE >> 1U),
#else
    .gtior_setting.gtior = 0U,
#endif
};
const timer_cfg_t g_timer1_cfg = {
    .mode = TIMER_MODE_PERIODIC,
    /* Actual period: 0.01666666 seconds. Actual duty: 50%. */ .period_counts =
        (uint32_t)0x196e6a,
    .duty_cycle_counts = 0xcb735,
    .source_div = (timer_source_div_t)0,
    .channel = 1,
    .p_callback = Timer0BIntHandler,
/** If NULL then do not add & */
#if defined(NULL)
    .p_context = NULL,
#else
    .p_context = &NULL,
#endif
    .p_extend = &g_timer1_extend,
    .cycle_end_ipl = (10),
#if defined(VECTOR_NUMBER_GPT1_COUNTER_OVERFLOW)
    .cycle_end_irq = VECTOR_NUMBER_GPT1_COUNTER_OVERFLOW,
#else
    .cycle_end_irq = FSP_INVALID_VECTOR,
#endif
};
/* Instance structure to use this module. */
const timer_instance_t g_timer1 = {
    .p_ctrl = &g_timer1_ctrl, .p_cfg = &g_timer1_cfg, .p_api = &g_timer_on_gpt};
gpt_instance_ctrl_t g_timer0_ctrl;
#if 0
const gpt_extended_pwm_cfg_t g_timer0_pwm_extend =
{
    .trough_ipl          = (BSP_IRQ_DISABLED),
#if defined(VECTOR_NUMBER_GPT0_COUNTER_UNDERFLOW)
    .trough_irq          = VECTOR_NUMBER_GPT0_COUNTER_UNDERFLOW,
#else
    .trough_irq          = FSP_INVALID_VECTOR,
#endif
    .poeg_link           = GPT_POEG_LINK_POEG0,
    .output_disable      = (gpt_output_disable_t) ( GPT_OUTPUT_DISABLE_NONE),
    .adc_trigger         = (gpt_adc_trigger_t) ( GPT_ADC_TRIGGER_NONE),
    .dead_time_count_up  = 0,
    .dead_time_count_down = 0,
    .adc_a_compare_match = 0,
    .adc_b_compare_match = 0,
    .interrupt_skip_source = GPT_INTERRUPT_SKIP_SOURCE_NONE,
    .interrupt_skip_count  = GPT_INTERRUPT_SKIP_COUNT_0,
    .interrupt_skip_adc    = GPT_INTERRUPT_SKIP_ADC_NONE,
    .gtioca_disable_setting = GPT_GTIOC_DISABLE_PROHIBITED,
    .gtiocb_disable_setting = GPT_GTIOC_DISABLE_PROHIBITED,
};
#endif
const gpt_extended_cfg_t g_timer0_extend = {
    .gtioca = {.output_enabled = false, .stop_level = GPT_PIN_LEVEL_LOW},
    .gtiocb = {.output_enabled = false, .stop_level = GPT_PIN_LEVEL_LOW},
    .start_source = (gpt_source_t)(GPT_SOURCE_NONE),
    .stop_source = (gpt_source_t)(GPT_SOURCE_NONE),
    .clear_source = (gpt_source_t)(GPT_SOURCE_NONE),
    .count_up_source = (gpt_source_t)(GPT_SOURCE_NONE),
    .count_down_source = (gpt_source_t)(GPT_SOURCE_NONE),
    .capture_a_source = (gpt_source_t)(GPT_SOURCE_NONE),
    .capture_b_source = (gpt_source_t)(GPT_SOURCE_NONE),
    .capture_a_ipl = (BSP_IRQ_DISABLED),
    .capture_b_ipl = (BSP_IRQ_DISABLED),
#if defined(VECTOR_NUMBER_GPT0_CAPTURE_COMPARE_A)
    .capture_a_irq = VECTOR_NUMBER_GPT0_CAPTURE_COMPARE_A,
#else
    .capture_a_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_GPT0_CAPTURE_COMPARE_B)
    .capture_b_irq = VECTOR_NUMBER_GPT0_CAPTURE_COMPARE_B,
#else
    .capture_b_irq = FSP_INVALID_VECTOR,
#endif
    .capture_filter_gtioca = GPT_CAPTURE_FILTER_NONE,
    .capture_filter_gtiocb = GPT_CAPTURE_FILTER_NONE,
#if 0
    .p_pwm_cfg                   = &g_timer0_pwm_extend,
#else
    .p_pwm_cfg = NULL,
#endif
#if 0
    .gtior_setting.gtior_b.gtioa  = (0U << 4U) | (0U << 2U) | (0U << 0U),
    .gtior_setting.gtior_b.oadflt = (uint32_t) GPT_PIN_LEVEL_LOW,
    .gtior_setting.gtior_b.oahld  = 0U,
    .gtior_setting.gtior_b.oae    = (uint32_t) false,
    .gtior_setting.gtior_b.oadf   = (uint32_t) GPT_GTIOC_DISABLE_PROHIBITED,
    .gtior_setting.gtior_b.nfaen  = ((uint32_t) GPT_CAPTURE_FILTER_NONE & 1U),
    .gtior_setting.gtior_b.nfcsa  = ((uint32_t) GPT_CAPTURE_FILTER_NONE >> 1U),
    .gtior_setting.gtior_b.gtiob  = (0U << 4U) | (0U << 2U) | (0U << 0U),
    .gtior_setting.gtior_b.obdflt = (uint32_t) GPT_PIN_LEVEL_LOW,
    .gtior_setting.gtior_b.obhld  = 0U,
    .gtior_setting.gtior_b.obe    = (uint32_t) false,
    .gtior_setting.gtior_b.obdf   = (uint32_t) GPT_GTIOC_DISABLE_PROHIBITED,
    .gtior_setting.gtior_b.nfben  = ((uint32_t) GPT_CAPTURE_FILTER_NONE & 1U),
    .gtior_setting.gtior_b.nfcsb  = ((uint32_t) GPT_CAPTURE_FILTER_NONE >> 1U),
#else
    .gtior_setting.gtior = 0U,
#endif
};
const timer_cfg_t g_timer0_cfg = {
    .mode = TIMER_MODE_PERIODIC,
    /* Actual period: 1 seconds. Actual duty: 50%. */ .period_counts =
        (uint32_t)0x5f5e100,
    .duty_cycle_counts = 0x2faf080,
    .source_div = (timer_source_div_t)0,
    .channel = 0,
    .p_callback = Timer0AIntHandler,
/** If NULL then do not add & */
#if defined(NULL)
    .p_context = NULL,
#else
    .p_context = &NULL,
#endif
    .p_extend = &g_timer0_extend,
    .cycle_end_ipl = (10),
#if defined(VECTOR_NUMBER_GPT0_COUNTER_OVERFLOW)
    .cycle_end_irq = VECTOR_NUMBER_GPT0_COUNTER_OVERFLOW,
#else
    .cycle_end_irq = FSP_INVALID_VECTOR,
#endif
};
/* Instance structure to use this module. */
const timer_instance_t g_timer0 = {
    .p_ctrl = &g_timer0_ctrl, .p_cfg = &g_timer0_cfg, .p_api = &g_timer_on_gpt};
sci_spi_instance_ctrl_t g_spi2_ctrl;

/** SPI extended configuration */
const sci_spi_extended_cfg_t g_spi2_cfg_extend = {
    .clk_div = {
        /* Actual calculated bitrate: 6250000. */ .cks = 0,
        .brr = 3,
        .mddr = 0,
    }};

const spi_cfg_t g_spi2_cfg = {
    .channel = 2,
    .operating_mode = SPI_MODE_MASTER,
    .clk_phase = SPI_CLK_PHASE_EDGE_ODD,
    .clk_polarity = SPI_CLK_POLARITY_LOW,
    .mode_fault = SPI_MODE_FAULT_ERROR_DISABLE,
    .bit_order = SPI_BIT_ORDER_MSB_FIRST,
#define RA_NOT_DEFINED (1)
#if (RA_NOT_DEFINED == RA_NOT_DEFINED)
    .p_transfer_tx = NULL,
#else
    .p_transfer_tx = &RA_NOT_DEFINED,
#endif
#if (RA_NOT_DEFINED == RA_NOT_DEFINED)
    .p_transfer_rx = NULL,
#else
    .p_transfer_rx = &RA_NOT_DEFINED,
#endif
#undef RA_NOT_DEFINED
    .p_callback = sci_spi_callback,
    .p_context = NULL,
    .rxi_irq = VECTOR_NUMBER_SCI2_RXI,
    .txi_irq = VECTOR_NUMBER_SCI2_TXI,
    .tei_irq = VECTOR_NUMBER_SCI2_TEI,
    .eri_irq = VECTOR_NUMBER_SCI2_ERI,
    .rxi_ipl = (12),
    .txi_ipl = (12),
    .tei_ipl = (12),
    .eri_ipl = (12),
    .p_extend = &g_spi2_cfg_extend,
};
/* Instance structure to use this module. */
const spi_instance_t g_spi2 = {
    .p_ctrl = &g_spi2_ctrl, .p_cfg = &g_spi2_cfg, .p_api = &g_spi_on_sci};
sci_uart_instance_ctrl_t g_uart0_ctrl;

baud_setting_t g_uart0_baud_setting = {
    /* Baud rate calculated with 0.469% error. */ .semr_baudrate_bits_b.abcse =
        0,
    .semr_baudrate_bits_b.abcs = 0,
    .semr_baudrate_bits_b.bgdm = 1,
    .cks = 0,
    .brr = 53,
    .mddr = (uint8_t)256,
    .semr_baudrate_bits_b.brme = false};

/** UART extended configuration for UARTonSCI HAL driver */
const sci_uart_extended_cfg_t g_uart0_cfg_extend = {
    .clock = SCI_UART_CLOCK_INT,
    .rx_edge_start = SCI_UART_START_BIT_FALLING_EDGE,
    .noise_cancel = SCI_UART_NOISE_CANCELLATION_DISABLE,
    .rx_fifo_trigger = SCI_UART_RX_FIFO_TRIGGER_MAX,
    .p_baud_setting = &g_uart0_baud_setting,
    .flow_control = SCI_UART_FLOW_CONTROL_RTS,
#if 0xFF != 0xFF
    .flow_control_pin = BSP_IO_PORT_FF_PIN_0xFF,
#else
    .flow_control_pin = (bsp_io_port_pin_t)UINT16_MAX,
#endif
    .rs485_setting =
        {
            .enable = SCI_UART_RS485_DISABLE,
            .polarity = SCI_UART_RS485_DE_POLARITY_HIGH,
#if 0xFF != 0xFF
            .de_control_pin = BSP_IO_PORT_FF_PIN_0xFF,
#else
            .de_control_pin = (bsp_io_port_pin_t)UINT16_MAX,
#endif
        },
};

/** UART interface configuration */
const uart_cfg_t g_uart0_cfg = {
    .channel = 0,
    .data_bits = UART_DATA_BITS_8,
    .parity = UART_PARITY_OFF,
    .stop_bits = UART_STOP_BITS_1,
    .p_callback = uartRxIntHandler,
    .p_context = NULL,
    .p_extend = &g_uart0_cfg_extend,
#define RA_NOT_DEFINED (1)
#if (RA_NOT_DEFINED == RA_NOT_DEFINED)
    .p_transfer_tx = NULL,
#else
    .p_transfer_tx = &RA_NOT_DEFINED,
#endif
#if (RA_NOT_DEFINED == RA_NOT_DEFINED)
    .p_transfer_rx = NULL,
#else
    .p_transfer_rx = &RA_NOT_DEFINED,
#endif
#undef RA_NOT_DEFINED
    .rxi_ipl = (12),
    .txi_ipl = (12),
    .tei_ipl = (12),
    .eri_ipl = (12),
#if defined(VECTOR_NUMBER_SCI0_RXI)
    .rxi_irq = VECTOR_NUMBER_SCI0_RXI,
#else
    .rxi_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_SCI0_TXI)
    .txi_irq = VECTOR_NUMBER_SCI0_TXI,
#else
    .txi_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_SCI0_TEI)
    .tei_irq = VECTOR_NUMBER_SCI0_TEI,
#else
    .tei_irq = FSP_INVALID_VECTOR,
#endif
#if defined(VECTOR_NUMBER_SCI0_ERI)
    .eri_irq = VECTOR_NUMBER_SCI0_ERI,
#else
    .eri_irq = FSP_INVALID_VECTOR,
#endif
};

/* Instance structure to use this module. */
const uart_instance_t g_uart0 = {
    .p_ctrl = &g_uart0_ctrl, .p_cfg = &g_uart0_cfg, .p_api = &g_uart_on_sci};
void g_hal_init(void) { g_common_init(); }
